tutorials/isothermalFluid/potentialFreeSurfaceMovingOscillatingBox/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

patches
{
    floatingObjectBottom
    {
        // Dictionary to construct new patch from
        patchInfo
        {
            type wall;
        }

        // Construct patch from a faceZone
        constructFrom zone;

        zone
        {
            type        normal;

            normal      (0 1 0);
            tol         0.01;

            floatingObject
            {
                type        patch;
                patch       floatingObject;
            }
        }
    }
}

// ************************************************************************* //
